---
title: TableCellCalculatedValueData
classe: Autodesk.Revit.DB.TableCellCalculatedValueData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# TableCellCalculatedValueData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `tableCellCalculatedValueData.IsValidObject` | Boolean |
| `Void Dispose()` | `tableCellCalculatedValueData.Dispose()` | Void |
| `String GetName()` | `tableCellCalculatedValueData.GetName()` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```